{
  "architectures": [
    "Qwen3Model"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 40960,
  "max_window_layers": 14,
  "model_type": "qwen3",
  "num_attention_heads": 16,
  "num_hidden_layers": 14,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": 128,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.52.3",
  "use_cache": true,
  "use_sliding_window": true,
  "vocab_size": 0
}
