{
  "attention_bias": false,
  "attention_dropout": 0,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 32768,
  "max_window_layers": 28,
  "model_type": "qwen3_omni_moe_talker_code_predictor",
  "num_attention_heads": 16,
  "num_code_groups": 8,
  "num_hidden_layers": 5,
  "num_key_value_heads": 8,
  "pruned_heads": {},
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": null,
  "tf_legacy_loss": false,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.0.dev0",
  "use_bfloat16": false,
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 2048
}